[
  {
    "serviceId": 1,
    "serviceName": "Winter Coat Fitting for Dogs",
    "providerName": "PawCare Studio",
    "providerEmail": "info@pawcare.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Keep your dog warm and stylish this winter with our Winter Coat Fitting service. We provide custom fittings to ensure the perfect comfort and mobility for dogs of all sizes. Our expert team will help you choose the best materials and designs to suit your pet’s personality and weather needs. From soft fleece to water-resistant outer layers, every option is designed for maximum coziness. We also offer tips on layering and seasonal wear to prevent cold-related discomfort. Your dog will not only stay warm but will look adorable too!",
    "image": "https://i.ibb.co.com/5WjTy3Lc/sweater-dog-clothes-icon-cartoon-600nw-1963341250.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 2,
    "serviceName": "Winter Grooming & Paw Treatment",
    "providerName": "CozyPets Grooming",
    "providerEmail": "hello@cozypets.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Our Winter Grooming & Paw Treatment service ensures your pet stays healthy and comfortable during the cold season. We offer a full grooming session that includes a gentle bath using winter-safe, moisturizing shampoos to protect your pet’s skin and coat. Our specialized paw treatment helps prevent cracking and dryness caused by snow, ice, and cold air. Each session is tailored to the specific needs of your dog or cat, taking into consideration their breed, age, and coat type. We also provide guidance on at-home care between visits. Your pet will leave feeling refreshed, protected, and ready to enjoy winter safely.",
    "image": "https://i.ibb.co.com/7x37d1jw/animal-grooming-salon-icon-pet-grooming-dog-or-cat-paw-scissors-with-comb-for-groomer-thin-line-symb.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 3,
    "serviceName": "Pet Nutrition Consultation",
    "providerName": "Healthy Paws Nutrition",
    "providerEmail": "contact@healthypaws.com",
    "price": 40,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "Give your pet the gift of optimal health with a personalized Pet Nutrition Consultation. Our experts provide detailed dietary plans based on your pet’s age, weight, activity level, and health conditions. We also recommend high-quality foods, supplements, and portion sizes to support growth, energy, and longevity. During the consultation, we address concerns such as allergies, digestive issues, and obesity prevention. You’ll also receive practical tips on feeding schedules and monitoring your pet’s nutritional intake. This service empowers pet owners to make informed decisions and ensures your furry friend thrives every day.",
    "image": "https://i.ibb.co.com/9mhS3Mzj/133438524-volunteer-feeding-homeless-dog-by-dry-food-vector-isolated-cartoon-style-man-and-hungry-pu.jpg",
    "category": "Consultation"
  },
  {
    "serviceId": 4,
    "serviceName": "Dog Walking Service",
    "providerName": "Happy Tails Walks",
    "providerEmail": "walks@happytails.com",
    "price": 20,
    "rating": 4.6,
    "slotsAvailable": 6,
    "description": "Our Dog Walking Service provides regular exercise and socialization opportunities for your furry companion. Each walk is tailored to your dog’s energy level, age, and temperament to ensure a safe and enjoyable experience. Our experienced handlers focus on leash training, behavior reinforcement, and safe interactions with other dogs. Regular walks help reduce anxiety, prevent obesity, and improve overall health. We also provide updates and photos after each session so you can see your dog’s progress. With us, your pet will stay active, happy, and mentally stimulated.",
    "image": "https://i.ibb.co.com/gLmSNjVr/man-walking-dog-vector-illustration-600nw-753285175.jpg",
    "category": "Exercise"
  },
  {
    "serviceId": 5,
    "serviceName": "Pet Photography Session",
    "providerName": "FurBaby Photography",
    "providerEmail": "shoots@furbabyphoto.com",
    "price": 50,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Capture your pet’s best moments with a professional Pet Photography Session. Our skilled photographers use creative lighting, props, and settings to showcase your pet’s personality and charm. We offer individualized sessions for dogs, cats, and other small animals, ensuring comfort and fun throughout the shoot. The session includes high-resolution images, post-processing, and digital copies for you to treasure forever. This is a perfect way to celebrate milestones, birthdays, or just everyday cuteness. With our guidance, your pet will shine in every frame and you’ll have memories to last a lifetime.",
    "image": "https://i.ibb.co.com/Gvf442mY/photographer-makes-photos-dog-studio-professional-light-woman-camera-shooting-pet-photo-session-phot.jpg",
    "category": "Photography"
  },
  {
    "serviceId": 6,
    "serviceName": "Cat Playtime & Enrichment",
    "providerName": "Whisker Wonderland",
    "providerEmail": "play@whiskerwonderland.com",
    "price": 15,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "Keep your cat active, engaged, and happy with our Cat Playtime & Enrichment service. We provide interactive toys, puzzles, and specially designed play sessions that stimulate both physical and mental health. Each activity is customized based on your cat’s preferences and energy levels to encourage movement and prevent boredom. Regular enrichment helps reduce stress, destructive behavior, and obesity in cats. Our team also shares tips for at-home enrichment and strategies to build a stronger bond with your pet. With Whisker Wonderland, your feline friend will enjoy a lively, stimulating, and joyful environment.",
    "image": "https://i.ibb.co.com/N25fn0SV/cute-little-girl-holding-gray-cat-her-hands-kid-caring-pet-vector-illustration-isolated-white-backgr.jpg",
    "category": "Entertainment"
  },
  {
    "serviceId": 7,
    "serviceName": "Pet First Aid Training",
    "providerName": "SafePaws Academy",
    "providerEmail": "training@safepaws.com",
    "price": 60,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "Learn essential Pet First Aid skills with SafePaws Academy and ensure your pets are safe in emergencies. Our training covers CPR, wound care, choking response, and handling common illnesses or injuries. You’ll gain hands-on experience in a supportive environment with professional guidance. We also teach you how to prepare a first aid kit and recognize early warning signs of health problems. This course equips pet owners with the knowledge to act quickly and confidently during critical situations. Protecting your furry family members has never been more accessible and empowering.",
    "image": "https://i.ibb.co.com/VZjbMpf/vector-illustration-man-yellow-coat-600nw-2615521505.jpg",
    "category": "Training"
  },
  {
    "serviceId": 8,
    "serviceName": "Pet Boarding & Daycare",
    "providerName": "Pawfect Stay",
    "providerEmail": "stay@pawfectstay.com",
    "price": 35,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "Pawfect Stay offers cozy and safe Pet Boarding & Daycare for your furry friends while you are away. Our facility is designed to provide comfort, security, and plenty of enrichment activities. Pets enjoy playtime, socialization, and restful spaces to feel at home. We offer daily updates, photos, and personalized care plans to keep you informed and your pet happy. Our trained staff monitors pets closely to ensure their well-being and health. Whether for a short visit or extended stay, your beloved companion will receive the attention and care they deserve.",
    "image": "https://i.ibb.co.com/svmCJcKk/pets-care-services-tiny-people-and-pet-hotel-daycare-veterinary-service-pet-shop-modern-flat-cartoon.jpg",
    "category": "Boarding"
  },
  {
    "serviceId": 9,
    "serviceName": "Dog Training: Basic Obedience",
    "providerName": "SmartPup Academy",
    "providerEmail": "train@smartpup.com",
    "price": 45,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "Our Dog Training: Basic Obedience classes help your dog develop good manners and strong behavioral skills. We focus on commands like sit, stay, come, heel, and leash walking for both puppies and adult dogs. Our experienced trainers use positive reinforcement techniques to ensure learning is effective and enjoyable. Classes also cover socialization skills and problem-solving exercises to build confidence. You will learn how to reinforce training at home and handle behavioral challenges efficiently. By the end of the program, your dog will be well-behaved, attentive, and happier overall.",
    "image": "https://i.ibb.co.com/hFw2rq21/trainer-does-obedience-training-bull-600nw-2656029815.jpg",
    "category": "Training"
  },
  {
    "serviceId": 10,
    "serviceName": "Pet Massage Therapy",
    "providerName": "PawSpa Wellness",
    "providerEmail": "relax@pawspa.com",
    "price": 40,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "Pamper your pet with relaxing Pet Massage Therapy at PawSpa Wellness. Our sessions are designed to reduce stress, relieve muscle tension, and improve joint mobility. Each massage is tailored to your pet’s size, age, and health condition to provide maximum benefit. We use safe, gentle techniques and soothing oils suitable for pets to promote overall wellness. Massage therapy also aids circulation, flexibility, and mental relaxation. Your furry friend will leave feeling calm, rejuvenated, and happy.",
    "image": "https://i.ibb.co.com/rKZgSxYk/dog-being-treated-chiropractic-clinic-600nw-1825869782.jpg",
    "category": "Wellness"
  },
  {
    "serviceId": 11,
    "serviceName": "Aquarium Setup & Maintenance",
    "providerName": "AquaWorld Experts",
    "providerEmail": "support@aquaworld.com",
    "price": 55,
    "rating": 4.6,
    "slotsAvailable": 2,
    "description": "AquaWorld Experts provides complete Aquarium Setup & Maintenance services to create a thriving aquatic environment. We handle everything from selecting the right tank, filtration, and lighting to choosing compatible fish species and decorations. Regular maintenance includes water quality testing, tank cleaning, and plant care to ensure your aquarium remains healthy. Our team provides guidance on feeding, disease prevention, and long-term aquarium management. This service is ideal for both beginners and experienced aquarists seeking a professional touch. With our expertise, your aquarium will be vibrant, balanced, and captivating.",
    "image": "https://i.ibb.co.com/pjgF4C1m/cartoon-girl-aquarium-fish-pet-care-childhood-learning-illustration-charming-image-shows-cheerful-in.jpg",
    "category": "Aquatics"
  },
  {
    "serviceId": 12,
    "serviceName": "Exotic Pet Care Consultation",
    "providerName": "Exotic Paws Clinic",
    "providerEmail": "consult@exoticpaws.com",
    "price": 50,
    "rating": 4.7,
    "slotsAvailable": 3,
    "description": "Ensure the best care for your unique pets with our Exotic Pet Care Consultation service. Our experts provide guidance on the nutrition, habitat, and health needs of exotic pets such as reptiles, birds, and small mammals. We cover preventive care, behavioral enrichment, and emergency readiness to keep your pets thriving. Each consultation is personalized to address your exotic pet’s specific requirements and environment. We also provide tips on handling, transportation, and socialization to ensure safety and well-being. With our advice, your exotic companions receive expert-level care and attention for a long, healthy life.",
    "image": "https://i.ibb.co.com/N68kGXm0/veterinarian-doctor-examining-dog-stethoscope-600nw-2451587965.jpg",
    "category": "Consultation"
  }
]
